GLOSSARY_DATA = [
    {
        "id": 0,
        "term": "Анализ функционала и производительности статического анализа",
        "definition": "Исследование подходов к оценке эффективности и функциональных возможностей систем статического анализа кода в контексте веб-приложений",
        "core": True,
    },
    {
        "id": 1,
        "term": "API (Application Programming Interface)",
        "definition": "Программный интерфейс приложения. Интерфейс можно рассматривать как сервисный контракт между двумя приложениями. Этот контракт определяет, как они взаимодействуют друг с другом, используя запросы и ответы",
        "source": "https://aws.amazon.com/ru/what-is/api/",
    },
    {
        "id": 2,
        "term": "CLI (Command Line Interface)",
        "definition": "Программный механизм, используемый для взаимодействия с операционной системой с помощью клавиатуры",
        "source": "https://aws.amazon.com/ru/what-is/cli/",
    },
    {
        "id": 3,
        "term": "DTO (Data Transfer Object)",
        "definition": "Объект передачи данных, который переносит данные между процессами",
        "source": "https://www.okta.com/identity-101/dto/",
    },
    {
        "id": 4,
        "term": "Статический анализ кода",
        "definition": "Процесс автоматической проверки исходного кода при помощи специальных утилит",
        "source": "https://elibrary.ru/item.asp?id=68478431",  # Научная статья
    },
    {
        "id": 5,
        "term": "Кэширование",
        "definition": "Процесс хранения копий данных в кэше или временном хранилище, чтобы к ним можно было быстрее получить доступ",
        "source": "https://www.cloudflare.com/learning/cdn/what-is-caching/",
    },
    {
        "id": 6,
        "term": "Flask",
        "definition": "Легкий фреймворк для веб-приложений WSGI на языке Python",
        "source": "https://flask.palletsprojects.com/en/stable/",
    },
    {
        "id": 7,
        "term": "Веб-приложение",
        "definition": "Программное приложение, хранящееся на удаленном сервере и предоставляемое через Интернет посредством интерфейса браузера",
        "source": "https://www.techtarget.com/searchsoftwarequality/definition/Web-application-Web-app",
    },
    {
        "id": 8,
        "term": "PEP 8",
        "definition": "Соглашения (руководство по стилю) для кода Python, составляющего стандартную библиотеку в основном дистрибутиве Python",
        "source": "https://peps.python.org/pep-0008/",
    },
    {
        "id": 9,
        "term": "Аннотация типов",
        "definition": "Необязательное обозначение, указывающее тип параметра или результата функции",
        "source": "https://runestone.academy/ns/books/published/fopp/Functions/TypeAnnotations.html",
    },
    {
        "id": 10,
        "term": "SQL-инъекция",
        "definition": "Атака, при которой злоумышленником производится вставка вредоносного кода в строки, передающиеся на сервер СУБД для синтаксического анализа и выполнения",
        "source": "https://elibrary.ru/item.asp?id=28433904",  # Научная статья
    },
    {
        "id": 11,
        "term": "REST",
        "definition": "Стиль архитектуры программного обеспечения для распределенных систем, таких как World Wide Web, который, как правило, используется для построения веб-служб",
        "source": "https://habr.com/ru/articles/38730/",
    },
    {
        "id": 12,
        "term": "CI (Continuous Integration)",
        "definition": "Практика ранней и частой интеграции всех ваших изменений кода в основную ветку общего репозитория исходного кода, автоматического тестирования каждого изменения при фиксации или слиянии и автоматического запуска сборки",
        "source": "https://about.gitlab.com/topics/ci-cd/",
    },
    {
        "id": 13,
        "term": "CD (Continuous Delivery)",
        "definition": "Практика разработки программного обеспечения, которая работает в связке с CI для автоматизации процесса создания инфраструктуры и выпуска приложений",
        "source": "https://about.gitlab.com/topics/ci-cd/",
    },
    {
        "id": 14,
        "term": "CI/CD",
        "definition": "Автоматизированный процесс, используемый группами разработчиков программного обеспечения для упрощения создания, тестирования и развертывания приложений",
        "source": "https://about.gitlab.com/topics/ci-cd/",
    },
    {
        "id": 15,
        "term": "Динамическая типизация",
        "definition": "Динамически-типизированные языки - это такие языки (например, JavaScript), в которых интерпретатор присваивает переменным тип во время выполнения программы, основываясь на значении переменной в момент выполнения",
        "source": "https://developer.mozilla.org/en-US/docs/Glossary/Dynamic_typing",
    },
    {
        "id": 16,
        "term": "XSS (Cross-Site Scripting)",
        "definition": "Тип инъекции, при котором вредоносные скрипты внедряются на добросовестные и надежные веб-сайты",
        "source": "https://owasp.org/www-community/attacks/xss/",
    },
    {
        "id": 17,
        "term": "Утиная типизация",
        "definition": "Стиль программирования, который не смотрит на тип объекта, чтобы определить, имеет ли он правильный интерфейс; вместо этого метод или атрибут просто вызывается или используется",
        "source": "https://docs.python.org/3/glossary.html#term-duck-typing",
    },
    {
        "id": 18,
        "term": "Цикломатическая сложность",
        "definition": "Показатель сложности исходного кода программы, определяющий количество линейно-независимых путей выполнения",
        "source": "https://testengineer.ru/cyclomatic-complexity/",
    },
    {
        "id": 19,
        "term": "СУБД (Система управления базами данных)",
        "definition": "Комплекс программно-языковых средств, позволяющих создать базы данных и управлять данными",
        "source": "https://www.nic.ru/help/chto-takoe-subd_8580.html",
    },
    {
        "id": 20,
        "term": "PyPI (Python Package Index)",
        "definition": "Хранилище программного обеспечения для языка программирования Python",
        "source": "https://pypi.org/",
    },
]
